/* 

1、什么是包？
Node.js 中的第三方模块 又叫做包。
第三方模块和包指的是同一个概念，只是叫法不同。

2、包的来源
不同于 Node.js 中内置模块与自定义模块，包是由第三方团队或个人开发的，供所有人使用，是开源的，免费下载使用。

3、为什么需要包
由于 Node.js 的内置模块仅提供了一些底层的 API，导致在基于内置模块进行开发时，效率很低。
包是基于内置模块封装出来的，提供了更高级、更方便的 API，极大提高了开发效率。
包和内置模块之间的关系，类似于 jQuery 和 浏览器内置 API 之间的关系。

4、从哪里下载包
www.npmjs.com，是全球最大的包共享平台，可以在此网站上搜索任何需要的包。
npm,Inc.公司提供了为 registry.npmjs.org 的服务器，对外共享所有的包，可以在此下载包。

5、如何下载包
npm,Inc. 公司提供了一个包管理工具，使用这个包管理工具，可以从服务器上下载包。
包管理工具（Node Package Manager）简称 npm 包管理工具。
例如查看当前 Node.js 版本，在终端使用命令： npm -v



*/